using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Game
{
    class Rest
    { public void ReadJokes() {
            string joke1 = "Как в России называют четвертьфунтовый чизбургер? - Никак";
            string joke2 = "- Мам, а когда мы пойдем в макдоналдс за бигмаком и ванильным мороженым? - Не знаю, я политикой на интересуюсь";
            string joke3 = "Россиянин по фамилии Хохлов настолько любил Вьетнам, что назвал сына Чё Там У";
            string joke4 = "Жил-был раввин и очень он любил играть в гольф. И вот как-то в СУББОТУ не выдержал и пошел играть в гольф. Увидел это ангел с небес и обратил внимание Бога на это обстоятельство.Бог говорит: — Сейчас накажем.Раввин бьет по шарику и попадает в лунку с одного удара.Ангел недоуменно восклицает:— И это называется наказанием?!— Ну да, кому он теперь об этом расскажет!";
            string joke5 = "Идет Штирлиц по лесу, видит — гриб. Поднимает руку, смотрит: гриб больше большого пальца. Штирлиц ничего не успел подумать.";
            string joke6 = "Капитан с ужасного бодуна просыпается от того, что его тормошит штурман:— Капитан, капитан! У нас пробоина ниже ватерлинии!Капитан в шоке начинает соображать, но получаетя весьма смутно:— Починить можем?— Никак нет, капитан!— Шлюпки на воду!— Нету шлюпок, капитан!— Раздать команде и пассажирам спасжилеты!— Капитан, спасжилет только один! — отвечает штурман и демонстрирует его капитану.Капитан что-то раздумывает, потом выхвает спасжилет, спешно надевает и выпрыгивает за борт.— Капитан! Капитан! Куда вы? Сегодня же первое апреля!..., что мы скажем по прибытии ?''Какая ... пробоина? Какая ... ватерлиния ? — Думал капитан самолета, неумолимо приближаясь к земле..";
            string joke7 = "Либерал-долгожитель недавно отметил своё 12-ти летие";
            string joke8 = "Загадка: Ты берешь в долг у мамы 25 рублей, и у папы 25, всего у тебя 50 рублей.Идешь в магазин и тратишь там ровно 45руб.По дороге домой ты даешь в долг подружке 3 рубля(ей не хватало на что то).У тебя остается 2 рубля.Ты приходишь домой, отдаешь долг маме - рубль и папе -рубль.Теперь ты должна им по 24руб.Итог: 24 24 равно 48, и 3 рубля тебе отдает подружка, получается 51.Вопрос: ты долго будешь анеки читать , а не делом заниматься ?) ";
            string joke9 = "Однажды знаменитый греческий философ Сократ встретил на улице знакомого, и тот ему говорит:— Сократ, знаешь, что я только что услышал об одном из твоих учеников?— Погоди, прежде, чем ты мне это расскажешь, я хочу провести небольшой экзамен, который называется «Испытание тройным фильтром».— Тройным фильтром?— Да, — продолжил Сократ. — Прежде, чем ты мне расскажешь что - либо о моем ученике, было бы неплохо, чтобы ты минутку подумал и профильтровал то, что ты собираешься мне рассказать.Первый фильтр — на Правдивость. Ты абсолютно уверен, что то, что ты собираешься мне рассказать, является абсолютной правдой?— Нет, Сократ, я услышал об этом от одного знакомого и решил...— Значит, — сказал Сократ, — ты точно не знаешь, правда это или нет.Тогда давай применим второй фильтр — на Добродетель. То, что ты собираешься мне сказать о моем ученике, — это что-нибудь хорошее ?— Нет, как раз наоборот...— Итак, — говорит Сократ, — ты хочешь мне сказать о нем что - то плохое, но ты не уверен, правда ли это. Однако, ты по-прежнему можешь пройти испытание и сообщить мне эту информацию, если она пройдет через третий фильтр — на Полезность. Принесет ли мне то, что ты собираешься рассказать, какую - либо пользу ?— Скорее всего, нет...— Таким образом, — подвел итог Сократ, — если ты собираешься рассказать мне что-то отрицательное, неправдивое и бесполезное о моем ученике, то зачем это рассказывать вообще?— Да, Сократ, как всегда, ты абсолютно прав.Именно поэтому Сократа считали великим философом и премного за это уважали.Однако Сократ также и не узнал, что его ученик Платон в тот день переспал с его женой Ксантиппой.";
            string joke10 = "В семье евреев-программистов не принято разговаривать о локалхосте";
            string joke11 = "Роскошный мраморный зал богатого поместья. В центре зала стоит большой белый рояль, за которым сидит элегантно одетый красивый, черноволосый юноша и что-то тихо наигрывает. Сбоку, облокотившись на рояль, стоит белокурая красавица, положив чуть склоненную голову на сложенные ладошки и внимательно прислушивается к звукам музыки.Она, вопросительно:— Слушай, а Киша сыграть сможешь?";
            string joke12 = "Двое спорят.— Это он!— Не он!— Он!— Не он!— Пойдём спросим... Походят.— Скажите, вы — это он?Небинарная персона почувствовала себя атакованной.";
            string joke13 = "- Чем отличается водитель гробовозки от игрока в бравл старс? - Водитель гробовозки не радуется когда ящик выпал";
            string joke14 = "Конец 80-х, Москва. Стоит огромная очередь за хлебом. Один мужик стоит и постоянно ворчит:— Хлеба нет, масла нет, мяса нет!Позор какой!Тут к нему подходят двое в штатском и говорят:— Гражданин, Вы лучше заткнитесь, раньше за такое Вас расстреляли бы!После их ухода ворчун обращается к толпе:— Хлеба нет, масла нет... и только что мне сообшили, что патроны тоже кончились";
            string joke15 = "Свалился на студии Netflix кирпич с крыши и зашиб человека. Народ собрался, переживает: «Блин, угнетения и неравенства и так хватает, так еще и кирпичи с крыш летят». «Во фигня», «не повезло чуваку» ну и так далее.Но одна небинарная персона пригляделась и говорит:— Спокойно.Туда ему и дорога — это же белый цисгендерный гетеро мужчина. А народ еще больше расстроился:— Блин, чё за фигня такая. Развелось их — кирпичу упасть негде.";
            string joke16 = "В дверь постучали null раз.Process finished with exit code 139(interrupted by signal 11: SIGSEGV), -подумал Штирлиц";
            string joke17 = "Плывет дед инсайд по озеру. Тут его рука хватает, и голос спрашивает:— Плюс семь или минус семь ? ";
            string joke18 = "- Папа, ты говоришь, семья – это маленькое государство. А кто ты?!- Президент, конечно!-А я ? !-Либеральная оппозиция.- Да какой я тебе либерал я даже не...-Ооо, либераху порвало!";
            string joke19 = "Джун программист прибегает с проекта к своему ментору и кричит:— Меня отпустили с проекта пораньше!— Как это здорово! Мы будем делать с тобой рефакторинг— рефакторинг? А как это?— Как! Ты не знаешь, что такое рефакторинг ? ! — и отказывается от менторства.Изумленный джун приходит к тимлиду и говорит:— Я вернулся пораньше с проекта, чтобы делать с тобой рефакторинг.— Как ? !Рефакторинг со мной ? ! — дает негативный отзыв, поднимает HR и прогоняет из компании.Обалдевший джуниор выходит на фриланс, пишет первому попавшемуся девелоперу и говорит:— Вот вам 20 фунтов, покажите мне, что такое рефакторинг.— Что ? !Рефакторинг за эти деньги??? — дает запрет на входящие сообщения и уходит.Тут программист вспоминает, что в ядре монолитного legacy проекта живет 90летний Сишник, который много повидал в жизни и наверняка знает, что такое рефакторинг.Он вбегает к Сишнику, который сидит по уши в отладке и проблемах с выделением памяти.— Помогите! — кричит он. — Уж вы-то знаете, что такое рефакторинг ? !Ядровик подпрыгивает от неожиданности и с паникой в голосе вскликает:— Ах! Рефакторинг, рефакторинг! - и умирает";
            string joke20 = "Как называют большой мертвый пельмень? — некроМАНТ ";
            string[] jokes = {joke1, joke2, joke7,joke20,joke18, joke4, joke5, joke6, joke10,joke19,joke3,joke9,joke8,joke11,joke13,joke14,joke15,joke16,joke17,joke12};
            
            string choice = "0";

            for (int i = 0; i < jokes.Length; i++) {
                Console.WriteLine(jokes[i]);
                Console.WriteLine("One more? 2 - no");
                choice = Console.ReadLine();
                if (choice == "2") { break; }
                else { continue; }
            }
           
            
            


        }
    }
}
